res/cf/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитИнформационныхБаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРепозиторияГит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобиратьТэги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСерверы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Серверы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеВетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВетки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыТелеграмм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТелеграм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗащищенныеКонтуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контур</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/Проекты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ВеткиПроекта(ПроектСсылка) Экспорт

	Результат = Новый Массив;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроектыОсновныеВетки.ИмяВетки КАК ИмяВетки
	               |ИЗ
	               |	Справочник.Проекты.ОсновныеВетки КАК ПроектыОсновныеВетки
	               |ГДЕ
	               |	ПроектыОсновныеВетки.Ссылка = &Ссылка
	               |	И НЕ ПроектыОсновныеВетки.Шаблон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПроектыОсновныеВетки.НомерСтроки";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПроектСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ИмяВетки);
	КонецЦикла;
	
	ДанныеПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектСсылка, "КодРепозиторияГит,СобиратьТэги");
	
	МассивВеток = ИнтеграцияГитлаб.ПолучитьВеткиПроекта(ДанныеПроекта.КодРепозиторияГит);
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроектыОсновныеВетки.ИмяВетки КАК ИмяВетки
	               |ИЗ
	               |	Справочник.Проекты.ОсновныеВетки КАК ПроектыОсновныеВетки
	               |ГДЕ
	               |	ПроектыОсновныеВетки.Ссылка = &Ссылка
	               |	И ПроектыОсновныеВетки.Шаблон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПроектыОсновныеВетки.НомерСтроки";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПроектСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для каждого Ветка Из МассивВеток Цикл
			Если СтрПодобнаПоРегулярномуВыражению(Ветка.name, Выборка.ИмяВетки, Истина, Ложь) Тогда
				Результат.Добавить(Ветка.name);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ДанныеПроекта.СобиратьТэги Тогда
		МассивТегов = ИнтеграцияГитлаб.ПолучитьТегиПроекта(ДанныеПроекта.КодРепозиторияГит);
		Для Каждого ТегПроекта Из МассивТегов Цикл
			Результат.Добавить(ТегПроекта.name);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ВеткиПроекта()

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|  ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Возвращает истина, если контур для проекта настроен как защищенный
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - Проверяемый проект
//  Контур	 - СправочникСсылка.Контуры - Проверяемый контур
// 
// Возвращаемое значение:
//  Булево - Истина, если проект защищен
//
Функция ЭтоЗащищенныйКонтур(Проект, Контур) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроектыЗащищенныеКонтуры.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Справочник.Проекты.ЗащищенныеКонтуры КАК ПроектыЗащищенныеКонтуры
	               |ГДЕ
	               |	ПроектыЗащищенныеКонтуры.Ссылка = &Ссылка
	               |	И ПроектыЗащищенныеКонтуры.Контур = &Контур";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Проект);
	Запрос.УстановитьПараметр("Контур", Контур);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ЭтоЗащищенныйКонтур()

#КонецОбласти
